Revit 2024 API
IExtElemChangeBeamSection Members
The IExtElemChangeBeamSection type exposes the following members.
Methods
Name | Description
ChangeSection
 The method that will be called when user wants to change beam section
See Also
IExtElemChangeBeamSection Interface
Autodesk.Revit.DB.Structure Namespace